[M_NameGame MissionDefinition]
MissionDescription="Lord Hammerlock doesn't like the name "Bullimont" and needs help finding a better name for the species before he publishes Pandora's Wild Beasts Calendar.. He has told you to go to three bath [-places] and interrogate the criminal (Satya) in order to gain a good reputation for interrogation.."
TeaserText="''Badass Good Looks - Hammerlock wants to look good.."

[M_NameGame:KillGrenade MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock isn't happy with the name "Bullimong" and needs your help to find a good name for the character before introducing him to the beasts of Pandora.. He asks if he can question the trio and threatens with a good report. The terrorist group was then brought in. Hammerlock decided that the "first beast" was better.. He asks them to try a new name, which involves first killing an animal with an explosive.."

[M_NameGame:KillMoreObjSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock is not happy with the name "Bulliman" and needs your help to find a better name for the breed. Before Pandora sent her soul to the desert. [Location] He will ask you to go to the three branch sections [-Location] and question the criminals. You can learn and make a good name. (Forced, of course) Hammerlock decided to raise his hand without saying the pirate's name twice, "Piepa.".'' He wanted some people to die.."

[M_NameGame:ShootprojectilesObjSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock doesn't like the name "bullymong" and instead promotes Pandora's animal calendar, he wants you to help him find a better animal name.. It tells you [where] to find the triangular distribution and the winner (ie by power) so you can study them and get the best name. Hammerlock tried calling the villains "Primitive Beasts", but his editor hated the name.. He tried to call these animals "ferovores" and to create new names and images to get them out of the sky.."
